In [1]:
import numpy as np
import pandas as pd

### 1

In [11]:
nums = np.random.randint(1, 1000, size=4)
even = nums[nums%2==0]
odd = nums[nums%2!=0]
nums

array([497, 992, 784, 568])

In [3]:
even_data=pd.DataFrame(even)
even_data.head(6)

     0
0  328
1  996
2  138
3  240
4  458
5  764

In [4]:
odd_data=pd.DataFrame(odd)
odd_data.tail(6)

      0
25  175
26  551
27  969
28  853
29  871
30  363

### 2

In [5]:
randoms = pd.Series(np.random.randint(1, 500, size=100))
(randoms[randoms % 2 == 0]).tail(5)

92    276
95    382
96    338
97    226
99    104
dtype: int32

### 4

In [6]:
names = ['Ali', 'Rom', 'Dip', 'Sim', 'Rik']
ages = np.random.randint(18, 22, size=5)
heights = np.random.randint(150, 180, size=5)
weights = np.random.randint(40, 90, size=5)
genders = ['Male', 'Female', 'Male', 'Female', 'Male']

data = {'Name': names,
        'Age': ages,
        'Height': heights,
        'Weight': weights,
        'Gender': genders}

students = pd.DataFrame(data,index=['A', 'B', 'C', 'D','E'])
students

  Name  Age  Height  Weight  Gender
A  Ali   20     160      54    Male
B  Rom   20     154      73  Female
C  Dip   19     166      67    Male
D  Sim   19     176      56  Female
E  Rik   18     173      57    Male

### 5

In [7]:
names = ['Ali', 'Arif', 'Kasim', 'Jazib', 'Hamid']
math = np.random.randint(0, 110, size=5)
physics = np.random.randint(0, 110, size=5)
chemistry = np.random.randint(0, 110, size=5)
biology = np.random.randint(0, 110, size=5)
comp=np.random.randint(0,110,size=5)

data = {'Name': names,
        'Mathematics': math,
        'Physics': physics,
        'Chemistry': chemistry,
        'Biology': biology,
       'Computer Science': comp}

students = pd.DataFrame(data,index=np.arange(1,6))

students['Total Marks'] = students['Mathematics'] + students['Physics'] + students['Chemistry'] + students['Biology']+students['Computer Science']
grades=['U','D','C','B','A']
ranges=[0,100,200,300,400,500]
students['Grade'] = pd.cut(students['Total Marks'], ranges, labels=grades)
display(students)

,Name,Mathematics,Physics,Chemistry,Biology,Computer Science,Total Marks,Grade
1,Ali,74,25,89,64,88,340,B
2,Arif,66,4,86,88,80,324,B
3,Kasim,87,38,62,2,10,199,D
4,Jazib,12,27,97,25,9,170,D
5,Hamid,57,22,66,10,63,218,C